Documents/ПрекращениеНаставничества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПрекращениеНаставничества</Name>
			<BasedOn>
				<xr:Item>Document.НазначениеНаставника</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наставляемый</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупнаяТарифнаяСтавка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменитьДоплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДисциплинарноеВзыскание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДисциплинарноеВзыскание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьНаставничество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наставники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставляемый</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьДоплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПрекращениеНаставничества/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Описание - возвращает описание разделов данных, которые содержит документ
// 
// Возвращаемое значение:
// 	Соответствие - описание разделов данных документов -
//	 *Ключ - Строка - имя раздела. Одно из значений структуры 
//		возвращаемой методом см. МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных
//   *Значение - см. МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных - описание раздела
//
Функция ОписаниеРазделовДанных() Экспорт
	
	ВсеРазделы = МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.ПлановыеНачисления, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "Утверждено";	
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден =  НСтр("ru = '%1 - документ не утвержден.'");
	
	Возврат ОписаниеРазделовДанных;
	
КонецФункции

// Описание - возвращает структуру со значениями по которым будут проверяться права на разделы документа
// 				 
// Параметры:
//  ДокументОбъект - ДокументОбъект.ПрекращениеНаставничества, ДанныеФормыСтруктура - объект или данные формы, 
//					отображающие данные документа, для которого нужно получить данные
//
// Возвращаемое значение:
// 	Структура -  см. НовыйЗначенияДоступа - значения доступа по которым будут проверяться права на документ
//
Функция ЗначенияДоступа(ДокументОбъект) Экспорт
	Возврат МногофункциональныеДокументыБЗК.ЗначенияДоступаПоСоставуДокумента(
		ДокументОбъект, 
		ДокументОбъект.Организация);
КонецФункции

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьКраткийСостав = Ложь;
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		,
		,
		"Наставник");
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		,
		,
		"Наставляемый");
	
	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает структуру с описанием данного вида документа.
//
Функция ОписаниеДокумента() Экспорт 

	ОписаниеДокумента = ЗарплатаКадрыРасширенныйКлиентСервер.СтруктураОписанияДокумента();
	
	ОписаниеДокумента.КраткоеНазваниеИменительныйПадеж	 = НСтр("ru = 'назначение наставника'");
	ОписаниеДокумента.КраткоеНазваниеРодительныйПадеж	 = НСтр("ru = 'назначения наставника'");
	ОписаниеДокумента.ИмяРеквизитаСотрудник				 = "Наставник";
	ОписаниеДокумента.ИмяРеквизитаДатаНачалаСобытия		 = "ДатаНачала";
	ОписаниеДокумента.ИмяРеквизитаДатаОкончанияСобытия	 = "ДатаОкончания";
	
	Возврат ОписаниеДокумента;

КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхДляНачисленияЗарплатыРасширенная, ЧтениеДанныхДляНачисленияЗарплатыРасширенная", , Ложь) Тогда
		// Приказ об отмене
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Документ.ПрекращениеНаставничества";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриказОбОтменеНаставничества";
		КомандаПечати.Представление = НСтр("ru = 'Приказ об отмене наставничества'");
		КомандаПечати.Порядок = 20;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОбОтменеНаставничества") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОбОтменеНаставничества",
			НСтр("ru = 'Приказ об отмене наставничества'"), ПечатьПриказаОбОтменеНаставничества(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ПрекращениеНаставничества.ПФ_MXL_ПриказОбОтменеНаставничества");
	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьПриказаОбОтменеНаставничества(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПрекращениеНаставничества_Приказ";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПрекращениеНаставничества.ПФ_MXL_ПриказОбОтменеНаставничества");
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		СтрокиПечати = ДанныеПечати.Значение;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Для Каждого СтрокаПечати Из СтрокиПечати Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Заполнить(СтрокаПечати);
			ТабличныйДокумент.Вывести(Шапка);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрекращениеНаставничества.Ссылка КАК Ссылка,
	|	ПрекращениеНаставничества.Номер КАК Номер,
	|	ПрекращениеНаставничества.Дата КАК Дата,
	|	ПрекращениеНаставничества.Организация КАК Организация,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	ПрекращениеНаставничества.Наставник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ПрекращениеНаставничества.Наставник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПрекращениеНаставничества.Наставник
	|		КОГДА ПрекращениеНаставничества.Наставник ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ПрекращениеНаставничества.Наставник.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ПрекращениеНаставничества.Наставляемый КАК Наставляемый,
	|	ПрекращениеНаставничества.ДатаОкончания КАК ДатаОкончания,
	|	ПрекращениеНаставничества.Начисление КАК Начисление,
	|	ПрекращениеНаставничества.ОтменитьДоплату КАК ОтменитьДоплату
	|ИЗ
	|	Документ.ПрекращениеНаставничества КАК ПрекращениеНаставничества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПрекращениеНаставничества.Организация = Организации.Ссылка
	|ГДЕ
	|	ПрекращениеНаставничества.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Увольнение.Ссылка,
	|	Увольнение.Номер,
	|	Увольнение.Дата,
	|	Увольнение.Организация,
	|	Организации.Наименование,
	|	УвольнениеНаставники.Наставник,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УвольнениеНаставники.Наставник) = ТИП(Справочник.ФизическиеЛица)
	|			ТОГДА УвольнениеНаставники.Наставник
	|		КОГДА ТИПЗНАЧЕНИЯ(УвольнениеНаставники.Наставник) = ТИП(Справочник.Сотрудники)
	|			ТОГДА УвольнениеНаставники.Наставник.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	УвольнениеНаставники.Наставляемый,
	|	УвольнениеНаставники.ДатаОкончания,
	|	УвольнениеНаставники.Начисление,
	|	УвольнениеНаставники.ОтменитьДоплату
	|ИЗ
	|	Документ.Увольнение.Наставники КАК УвольнениеНаставники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Увольнение КАК Увольнение
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Увольнение.Организация = Организации.Ссылка
	|		ПО УвольнениеНаставники.Ссылка = Увольнение.Ссылка
	|ГДЕ
	|	Увольнение.Ссылка В(&МассивОбъектов)
	|	И Увольнение.ЗавершитьНаставничество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УвольнениеСписком.Ссылка,
	|	УвольнениеСписком.Номер,
	|	УвольнениеСписком.Дата,
	|	УвольнениеСписком.Организация,
	|	Организации.Наименование,
	|	УвольнениеСпискомСотрудники.Сотрудник,
	|	УвольнениеСпискомСотрудники.ФизическоеЛицо,
	|	УвольнениеСпискомНаставники.Наставляемый,
	|	УвольнениеСпискомНаставники.ДатаОкончания,
	|	УвольнениеСпискомНаставники.Начисление,
	|	УвольнениеСпискомНаставники.ОтменитьДоплату
	|ИЗ
	|	Документ.УвольнениеСписком.Наставники КАК УвольнениеСпискомНаставники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком КАК УвольнениеСписком
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО УвольнениеСписком.Организация = Организации.Ссылка
	|		ПО УвольнениеСпискомНаставники.Ссылка = УвольнениеСписком.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
	|		ПО УвольнениеСпискомНаставники.ИдентификаторСтрокиСотрудника = УвольнениеСпискомСотрудники.ИдентификаторСтрокиСотрудника
	|			И УвольнениеСпискомНаставники.Ссылка = УвольнениеСпискомСотрудники.Ссылка
	|ГДЕ
	|	УвольнениеСписком.Ссылка В(&МассивОбъектов)
	|	И УвольнениеСпискомСотрудники.ЗавершитьНаставничество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДисциплинарноеВзыскание.Ссылка,
	|	ДисциплинарноеВзыскание.Номер,
	|	ДисциплинарноеВзыскание.Дата,
	|	ДисциплинарноеВзыскание.Организация,
	|	Организации.Наименование,
	|	ДисциплинарноеВзысканиеНаставники.Наставник,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДисциплинарноеВзысканиеНаставники.Наставник) = ТИП(Справочник.ФизическиеЛица)
	|			ТОГДА ДисциплинарноеВзысканиеНаставники.Наставник
	|		КОГДА ТИПЗНАЧЕНИЯ(ДисциплинарноеВзысканиеНаставники.Начисление) = ТИП(Справочник.Сотрудники)
	|			ТОГДА ДисциплинарноеВзысканиеНаставники.Наставник.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДисциплинарноеВзысканиеНаставники.Наставляемый,
	|	ДисциплинарноеВзысканиеНаставники.ДатаОкончания,
	|	ДисциплинарноеВзысканиеНаставники.Начисление,
	|	ДисциплинарноеВзысканиеНаставники.ОтменитьДоплату
	|ИЗ
	|	Документ.ДисциплинарноеВзыскание КАК ДисциплинарноеВзыскание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДисциплинарноеВзыскание.Организация = Организации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание.Наставники КАК ДисциплинарноеВзысканиеНаставники
	|		ПО ДисциплинарноеВзыскание.Ссылка = ДисциплинарноеВзысканиеНаставники.Ссылка
	|ГДЕ
	|	ДисциплинарноеВзыскание.Ссылка В(&МассивОбъектов)
	|	И ДисциплинарноеВзыскание.ЗавершитьНаставничество";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		СтрокиПечати = Новый Массив;
		ДанныеПечатиДокумента = РезультатЗапроса.НайтиСтроки(Новый Структура("Ссылка", ДокументСсылка));
		
		Для Каждого ДокументДляПечати Из ДанныеПечатиДокумента Цикл
			
			ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДокументДляПечати);
			ДанныеПечати.Дата = Формат(ДанныеПечати.Дата, "ДЛФ=D");
			
			// Подготовка номера документа.
			ДанныеПечати.Номер = КадровыйУчетРасширенный.НомерКадровогоПриказа(ДанныеПечати.Номер);
			
			// Юридический адрес организации.
			ДанныеПечати.Вставить("АдресОрганизации", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ДанныеПечати.Организация,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
			ДокументДляПечати.Дата));
			
			// Данные сотрудника.
			ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДляПечати.Сотрудник), 
			"ТрудовойДоговорНомер, ТрудовойДоговорДата, Должность, ФИОПолные, Пол, АдресПоПропискеПредставление, ДокументВид, "
			+ "ДокументСерия, ДокументНомер", ДокументДляПечати.ДатаОкончания);
			
			Если ДанныеСотрудника.Количество() > 0 Тогда
				ДанныеПечати.Вставить("ФИОСотрудника", ДанныеСотрудника[0].ФИОПолные);
				ДанныеПечати.Вставить("ФИОСотрудникаСокращенное", ДанныеСотрудника[0].ФИОПолные);
				ДанныеПечати.Вставить("ФИОСотрудникаДательный", ДанныеСотрудника[0].ФИОПолные);
				ДанныеПечати.Вставить("ФИОСотрудникаТворительный", ДанныеСотрудника[0].ФИОПолные);
				ДанныеПечати.Вставить("АдресСотрудника", ДанныеСотрудника[0].АдресПоПропискеПредставление);
				ДанныеПечати.Вставить("ДокументВид", ДанныеСотрудника[0].ДокументВид);
				ДанныеПечати.Вставить("ДокументСерия", ДанныеСотрудника[0].ДокументСерия);
				ДанныеПечати.Вставить("ДокументНомер", ДанныеСотрудника[0].ДокументНомер);
				ДанныеПечати.Вставить("ДолжностьНаставника", ДанныеСотрудника[0].Должность);
				ДанныеПечати.Вставить("ДолжностьНаставникаТворительный",
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеПечати.ДолжностьНаставника), 5));
				
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеПечати.ФИОСотрудникаДательный),
				3, ДанныеПечати.ФИОСотрудникаДательный, ДанныеСотрудника[0].Пол, ДанныеСотрудника[0].ФизическоеЛицо);
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеПечати.ФИОСотрудникаТворительный),
				5, ДанныеПечати.ФИОСотрудникаТворительный, ДанныеСотрудника[0].Пол, ДанныеСотрудника[0].ФизическоеЛицо);
				
				ДанныеПечати.ФИОСотрудникаСокращенное = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ДанныеПечати.ФИОСотрудникаСокращенное);
				
				Если ДанныеСотрудника[0].Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
					ДанныеПечати.Вставить("Именуемый", НСтр("ru = 'именуемый'"));
					ДанныеПечати.Вставить("Занимающий", НСтр("ru = 'занимающий'"));
				Иначе
					ДанныеПечати.Вставить("Именуемый", НСтр("ru = 'именуемая'"));
					ДанныеПечати.Вставить("Занимающий", НСтр("ru = 'занимающая'"));
				КонецЕсли;
				
			КонецЕсли;
			
			// Данные наставляемого.
			ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДляПечати.Наставляемый), 
			"Должность", ДокументДляПечати.Дата);
			
			Если ТипЗнч(ДокументДляПечати.Наставляемый) = Тип("СправочникСсылка.Сотрудники") Тогда
				
				ДанныеФизическогоЛица = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДляПечати.Наставляемый.ФизическоеЛицо), 
				"ФИОПолные, Пол", ДокументДляПечати.ДатаОкончания);
				
				ФизическоеЛицо = ДанныеФизическогоЛица[0].ФизическоеЛицо;
				
			ИначеЕсли ТипЗнч(ДокументДляПечати.Наставляемый) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				
				ДанныеФизическогоЛица = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДляПечати.Наставляемый), 
				"ФИОПолные, Пол", ДокументДляПечати.ДатаОкончания);
				
				ФизическоеЛицо = ДанныеФизическогоЛица[0].ФизическоеЛицо;
				
			ИначеЕсли ТипЗнч(ДокументДляПечати.Наставляемый) = Тип("СправочникСсылка.Кандидаты") Тогда
				
				ДанныеФизическогоЛица = Новый Массив;
				
				ЛичныеДанныеКандидатов = Справочники.Кандидаты.ЛичныеДанныеКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументДляПечати.Наставляемый));
				ДанныеКандидата = ЛичныеДанныеКандидатов.Получить(ДокументДляПечати.Наставляемый);
				
				Если Не ДанныеКандидата= Неопределено Тогда
					ДанныеФизическогоЛица.Добавить(Новый Структура("ФИОПолные, Пол", ДанныеКандидата.ФИО, ДанныеКандидата.Пол));
				КонецЕсли;
				
				ФизическоеЛицо = Неопределено;
				
			КонецЕсли;
			
			Если ДанныеФизическогоЛица.Количество() > 0 Тогда
				ДанныеПечати.Вставить("ФИОНаставляемого", ДанныеФизическогоЛица[0].ФИОПолные);
				ДанныеПечати.Вставить("ФИОНаставляемогоРодительный", ДанныеФизическогоЛица[0].ФИОПолные);
				
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеПечати.ФИОНаставляемогоРодительный),
				2, ДанныеПечати.ФИОНаставляемогоРодительный, ДанныеФизическогоЛица[0].Пол, ФизическоеЛицо);
			КонецЕсли;
			
			Если ДанныеСотрудника.Количество() > 0 Тогда
				ДанныеПечати.Вставить("ДолжностьНаставляемого", ДанныеСотрудника[0].Должность);
				ДанныеПечати.Вставить("ДолжностьНаставляемогоРодительный",
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеПечати.ДолжностьНаставляемого), 2));
			КонецЕсли;
			
			ДанныеОтветственныхЛиц = ЗарплатаКадрыРасширенный.ОтветственныеЛицаОрганизации(ДокументДляПечати.Организация, "Руководитель,ДолжностьРуководителя", ДокументДляПечати.Дата);
			ДанныеПечати.Вставить("Руководитель", ДанныеОтветственныхЛиц.Руководитель);
			ДанныеПечати.Вставить("ДолжностьРуководителя", ДанныеОтветственныхЛиц.ДолжностьРуководителя);
			
			СтрокиПечати.Добавить(ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПечати));
			
		КонецЦикла;
		
		ДанныеПечатиОбъектов.Вставить(ДокументСсылка, СтрокиПечати);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьОбъектПоНазначениюНаставника(Объект, НазначениеНаставника = Неопределено) Экспорт
	
	Если НазначениеНаставника <> Неопределено Тогда
		Объект.ДокументОснование = НазначениеНаставника;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли; 
	
	ЗначенияРеквизитовОснования = Новый Структура("Организация,ДатаНачала,ДатаОкончания,Наставник,Наставляемый,НазначитьДоплату,Начисление");
	ЗначенияРеквизитовОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование, ЗначенияРеквизитовОснования);
	
	Объект.Организация		= ЗначенияРеквизитовОснования.Организация;
	Объект.Наставник		= ЗначенияРеквизитовОснования.Наставник;
	Объект.Наставляемый		= ЗначенияРеквизитовОснования.Наставляемый;
	Объект.Начисление		= ЗначенияРеквизитовОснования.Начисление;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.ДатаОкончания = Макс(ЗначенияРеквизитовОснования.ДатаНачала,ЗначенияРеквизитовОснования.ДатаОкончания);
	КонецЕсли;
	
	ПраваНаДокумент = ЗарплатаКадрыРасширенный.ПраваНаМногофункциональныйДокумент(Объект);
	Если ПраваНаДокумент.ОграниченияНаУровнеЗаписей.ИзменениеБезОграничений Тогда
		Объект.ОтменитьДоплату	= ЗначенияРеквизитовОснования.НазначитьДоплату;
		Объект.Утверждено	= Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента) Экспорт
	
	ЗарплатаКадры.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента, "ДатаОкончания");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
